In [5]:
#Operations Between Data Structures
#Flexible Arithmetic Methods :: add(), sub(), mul(), div()
import pandas as pd
import numpy as np

frame1 = pd.DataFrame(np.arange(16).reshape(4,4), index=[0,1,2,3], columns = ['D1', 'D2', 'D3', 'D4'])
print(frame1)

   D1  D2  D3  D4
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [6]:
frame2 = pd.DataFrame(np.arange(16).reshape(4,4), index=[0,1,2,4], columns = ['D1', 'D2', 'D3', 'D5'])

print(frame2)

   D1  D2  D3  D5
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
4  12  13  14  15

In [7]:
frame1.add(frame2)

     D1    D2    D3  D4  D5
0   0.0   2.0   4.0 NaN NaN
1   8.0  10.0  12.0 NaN NaN
2  16.0  18.0  20.0 NaN NaN
3   NaN   NaN   NaN NaN NaN
4   NaN   NaN   NaN NaN NaN

In [8]:
frame1.sub(frame2)

    D1   D2   D3  D4  D5
0  0.0  0.0  0.0 NaN NaN
1  0.0  0.0  0.0 NaN NaN
2  0.0  0.0  0.0 NaN NaN
3  NaN  NaN  NaN NaN NaN
4  NaN  NaN  NaN NaN NaN

In [11]:
#Operations Between DataFrame and Series
ser1 = pd.Series([0,1,2,3], index=['D1', 'D2', 'D3', 'D4'])

print(ser1)

#subtracting a series from a DataFrame
out = frame1 - ser1
print(out)

D1    0
D2    1
D3    2
D4    3
dtype: int64
   D1  D2  D3  D4
0   0   0   0   0
1   4   4   4   4
2   8   8   8   8
3  12  12  12  12

In [13]:
frame1 = pd.DataFrame(np.arange(16).reshape(4,4), index = ['D1', 'D2', 'D3', 'D4'], columns = ['C1', 'C2', 'C3', 'C4'])
np.sqrt(frame1)

          C1        C2        C3        C4
D1  0.000000  1.000000  1.414214  1.732051
D2  2.000000  2.236068  2.449490  2.645751
D3  2.828427  3.000000  3.162278  3.316625
D4  3.464102  3.605551  3.741657  3.872983

In [14]:
f1 = lambda x : pd.Series([x.min(), x.max()], index=['min','max'])

frame1.apply(f1)

     C1  C2  C3  C4
min   0   1   2   3
max  12  13  14  15

In [15]:
frame1.sum()

C1    24
C2    28
C3    32
C4    36
dtype: int64

In [16]:
frame1.describe()

              C1         C2         C3         C4
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

In [28]:
# Sorting and Ranking

ser11 = pd.Series([0,3,7,4,1], index = ['C','E', 'A','B','D'])

print(ser11)

print(ser11.sort_index())

print(ser11.sort_index(ascending = False))

C    0
E    3
A    7
B    4
D    1
dtype: int64
A    7
B    4
C    0
D    1
E    3
dtype: int64
E    3
D    1
C    0
B    4
A    7
dtype: int64

In [29]:
#DataFrame sorting 

frame = pd.DataFrame(np.arange(16).reshape((4,4)),index=['red','blue','yellow','white'],
                     columns=['ball','pen','pencil','paper'])

print(frame)

print(frame.sort_index())

print(frame.sort_index(ascending = False))

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15
        ball  pen  pencil  paper
blue       4    5       6      7
red        0    1       2      3
white     12   13      14     15
yellow     8    9      10     11
        ball  pen  pencil  paper
yellow     8    9      10     11
white     12   13      14     15
red        0    1       2      3
blue       4    5       6      7

In [30]:
# sorting values 
ser11 = pd.Series([0,3,7,4,1], index = ['C','E', 'A','B','D'])

print(ser11.sort_values())

C    0
D    1
E    3
B    4
A    7
dtype: int64

In [33]:
print(frame)

frame['pen']['yellow'] = 4

frame.sort_values(['pen', 'pencil'], ascending = False)

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    4      10     11
white     12   13      14     15

        ball  pen  pencil  paper
white     12   13      14     15
blue       4    5       6      7
yellow     8    4      10     11
red        0    1       2      3

In [36]:
# Ranking 
print(ser11)

print(ser11.rank())

print(ser11.rank(ascending = False))

C    0
E    3
A    7
B    4
D    1
dtype: int64
C    1.0
E    3.0
A    5.0
B    4.0
D    2.0
dtype: float64
C    5.0
E    3.0
A    1.0
B    2.0
D    4.0
dtype: float64

In [42]:
# Correlation and covariance 

seq2 = pd.Series([3,4,3,4,5,4,3,2],['2006','2007','2008','2009','2010','2011','2012','2013'])
seq = pd.Series([1,2,3,4,4,3,2,1],['2006','2007','2008','2009','2010','2011','2012','2013'])

seq2.corr(seq)

seq2.cov(seq)

<bound method DataFrame.corr of         ball  pen  pencil  paper
red        1    4       3      6
blue       4    5       6      1
yellow     3    3       1      5
white      4    1       6      4>

In [45]:
frame2 = pd.DataFrame([[1,4,3,6],[4,5,6,1],[3,3,1,5],[4,1,6,4]],index=['red','blue','yellow','white'],
                      columns=['ball','pen','pencil','paper'])

print(frame2.corr())

print(frame2.cov())

            ball       pen    pencil     paper
ball    1.000000 -0.276026  0.577350 -0.763763
pen    -0.276026  1.000000 -0.079682 -0.361403
pencil  0.577350 -0.079682  1.000000 -0.692935
paper  -0.763763 -0.361403 -0.692935  1.000000
            ball       pen    pencil     paper
ball    2.000000 -0.666667  2.000000 -2.333333
pen    -0.666667  2.916667 -0.333333 -1.333333
pencil  2.000000 -0.333333  6.000000 -3.666667
paper  -2.333333 -1.333333 -3.666667  4.666667

In [47]:
# Playing with Not a Number (NaN)
ser1 = pd.Series([11,22,33,np.NaN,55])

ser1.dropna()

ser1[ser1.notnull()]

0    11.0
1    22.0
2    33.0
4    55.0
dtype: float64

In [48]:
frame1 = pd.DataFrame([[11,22,np.NaN,44],[7,np.NaN,np.NaN,28],[13,26,np.NaN,38]])

frame1.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [49]:
frame1.dropna(how = 'all')

    0     1   2   3
0  11  22.0 NaN  44
1   7   NaN NaN  28
2  13  26.0 NaN  38

In [50]:
frame1.dropna(how = 'all', axis = 1)

    0     1   3
0  11  22.0  44
1   7   NaN  28
2  13  26.0  38

In [51]:
#Filling in NaN Occurrences
frame1.fillna(0)

    0     1    2   3
0  11  22.0  0.0  44
1   7   0.0  0.0  28
2  13  26.0  0.0  38

In [52]:
frame1.fillna({0:0,1:1,2:2})

    0     1    2   3
0  11  22.0  2.0  44
1   7   1.0  2.0  28
2  13  26.0  2.0  38

In [54]:
# Hierarchical Indexing and Leveling

mser = pd.Series(np.random.rand(8),index=[['white','white','white','blue','blue','red','red','red'],
                                              ['up','down','right','up','down','up','down','left']])

print(mser)

white  up       0.027870
       down     0.128433
       right    0.845243
blue   up       0.489496
       down     0.860700
red    up       0.707451
       down     0.087967
       left     0.347919
dtype: float64

In [55]:
mser.index

MultiIndex(levels=[['blue', 'red', 'white'], ['down', 'left', 'right', 'up']],
           labels=[[2, 2, 2, 0, 0, 1, 1, 1], [3, 0, 2, 3, 0, 3, 0, 1]])

In [56]:
mser['white']

up       0.027870
down     0.128433
right    0.845243
dtype: float64

In [57]:
mser[:,'up']

white    0.027870
blue     0.489496
red      0.707451
dtype: float64

In [58]:
mser['white','up']

0.027870053237521564

In [59]:
# unstack would transform the secondary indexes to new columns 
mser.unstack()

           down      left     right        up
blue   0.860700       NaN       NaN  0.489496
red    0.087967  0.347919       NaN  0.707451
white  0.128433       NaN  0.845243  0.027870

In [61]:
frame

frame.stack()

red     ball       0
        pen        1
        pencil     2
        paper      3
blue    ball       4
        pen        5
        pencil     6
        paper      7
yellow  ball       8
        pen        4
        pencil    10
        paper     11
white   ball      12
        pen       13
        pencil    14
        paper     15
dtype: int64

In [63]:
mframe = pd.DataFrame(np.random.randn(16).reshape(4,4),
                          index=[['white','white','red','red'], ['up','down','up','down']],
                          columns=[['pen','pen','paper','paper'],[1,2,1,2]])
print(mframe)

                 pen               paper
                   1         2         1         2
white up   -0.918197  0.157138 -0.649139  1.243963
      down  0.769858 -0.788765 -0.429650  0.111937
red   up   -1.701102 -1.131731 -0.228080 -0.592873
      down  0.536087 -0.323967  0.925632 -0.315394

In [66]:
# Reordering and Sorting Levels
mframe.columns.names = ['objects','id']

mframe

mframe.index.names = ['colors','status']

mframe

objects             pen               paper
id                    1         2         1         2
colors status
white  up     -0.918197  0.157138 -0.649139  1.243963
       down    0.769858 -0.788765 -0.429650  0.111937
red    up     -1.701102 -1.131731 -0.228080 -0.592873
       down    0.536087 -0.323967  0.925632 -0.315394

In [67]:
mframe.swaplevel('status','colors')

objects             pen               paper
id                    1         2         1         2
status colors
up     white  -0.918197  0.157138 -0.649139  1.243963
down   white   0.769858 -0.788765 -0.429650  0.111937
up     red    -1.701102 -1.131731 -0.228080 -0.592873
down   red     0.536087 -0.323967  0.925632 -0.315394

In [68]:
mframe.sort_index(level='colors')

objects             pen               paper
id                    1         2         1         2
colors status
red    down    0.536087 -0.323967  0.925632 -0.315394
       up     -1.701102 -1.131731 -0.228080 -0.592873
white  down    0.769858 -0.788765 -0.429650  0.111937
       up     -0.918197  0.157138 -0.649139  1.243963

In [69]:
#Summary Statistic by Level
mframe.sum(level='colors')

objects       pen               paper
id              1         2         1         2
colors
white   -0.148339 -0.631627 -1.078788  1.355900
red     -1.165015 -1.455698  0.697552 -0.908266

In [70]:
mframe.sum(level='id', axis=1)

id                    1         2
colors status
white  up     -1.567335  1.401101
       down    0.340208 -0.676829
red    up     -1.929182 -1.724604
       down    1.461719 -0.639360